[
    {
        "index": "7",
        "text": "Un equipo de desarrollo con distintos recursos operacionales crea una aplicación para venta de cuadros de una galería. Los dueños piden que pueda ser utilizada en celulares y tabletas con el mejor rendimiento. ¿Cuál es un requerimiento que corresponde a la necesidad planteada?",
        "answer": "\"La aplicación será desarrollada utilizando HTML5\".",
        "explanation": "HTML5 permite el desarrollo de aplicaciones híbridas que funcionan en múltiples dispositivos, optimizando recursos sin necesidad de desarrollo nativo para cada sistema operativo."
    },
    {
        "index": "8",
        "text": "En una empresa del sector asegurador se necesita calcular la tendencia de las primas de seguro y realizar un pronóstico de su comportamiento para los siguientes 24 meses, usando gráficas, sin invertir tiempo programando el cálculo de las tendencias y los pronósticos ni comprando ningún componente adicional. ¿Qué lenguaje de programación se requiere?",
        "answer": "\"Python\".",
        "explanation": "Python tiene bibliotecas como `matplotlib` y `pandas` que permiten realizar cálculos avanzados y gráficos sin mucho esfuerzo de programación, cumpliendo con los requisitos de la pregunta."
    },
    {
        "index": "9",
        "text": "Una vez que se autoriza el desarrollo de una aplicación móvil para el control de las unidades de reparto de una empresa, se solicita al Área de Sistemas que se elabore el cronograma de trabajo determinando el menor tiempo posible de entrega, ya que será un desarrollo prioritario para la empresa. ¿Qué aspecto se debe revisar para poder elaborarlo?",
        "answer": "No hay una respuesta seleccionada.",
        "explanation": "Este tipo de pregunta requiere evaluación adicional para priorizar proyectos y determinar la infraestructura y recursos necesarios."
    },
    {
        "index": "10",
        "text": "En un sistema de nómina de una empresa se detectaron varios accesos no autorizados y se determinó que se realizaron mediante crackers de contraseñas de usuarios activos. A pesar de solicitar al usuario adoptar prácticas seguras, se solicita al Área de Sistemas que apliquen otros mecanismos aprobados en las políticas informáticas. ¿Qué requerimiento debe quedar integrado en las políticas informáticas para mitigar el riesgo detectado?",
        "answer": "\"Aplicar la autenticación multifactor en todos los sistemas\".",
        "explanation": "La autenticación multifactor añade una capa adicional de seguridad al exigir múltiples formas de verificación, lo que reduce significativamente el riesgo de accesos no autorizados."
    },
    {
        "index": "11",
        "text": "Un sitio web de una tienda en línea sufrió un ataque mediante inyección SQL que corrompió algunos datos. Aunque el daño fue limitado y reparado con copias de respaldo, se definió un requerimiento para prevenir ataques similares. ¿Qué medidas deben implementarse?",
        "answer": "\"Proteger las interfaces del sistema\".",
        "explanation": "Proteger las interfaces incluye el uso de parámetros preparados, sanitización de entradas y mecanismos de validación para prevenir ataques de inyección SQL, abordando directamente la vulnerabilidad descrita."
    },
    {
        "index": "12",
        "text": "Una zapatería contrató a un desarrollador para diseñar un software que permita llevar el control del inventario de sus tiendas. Una vez concluida la etapa de análisis, el cliente verificó con el desarrollador que todos los estados posibles, cambios de estado, entradas, productos y restricciones estuvieran ya descritos en alguno de los requerimientos. ¿A qué característica de los requerimientos corresponden estos elementos?",
        "answer": "No hay una respuesta seleccionada.",
        "explanation": "Este tipo de pregunta requiere evaluar aspectos como \"Completitud\" (cobertura total de los elementos requeridos), pero no se seleccionó una respuesta en el archivo."
    },
    {
        "index": "13",
        "text": "La empresa Atom, S.A. está desarrollando un software. El cliente le especificó que uno de los requerimientos que desea es que este contenga una alta velocidad para comenzar a trabajar como elemento de alta importancia. ¿Qué característica atiende el requerimiento señalado por el cliente?",
        "answer": "\"Priorizable\".",
        "explanation": "La característica de \"Priorizable\" permite identificar elementos de alta importancia en el desarrollo, como la velocidad, que pueden ser atendidos antes que otros requerimientos menos urgentes."
    },
    {
        "index": "14",
        "text": "Una solución informática que se va a desarrollar debe determinar las preferencias de los usuarios de redes sociales con base en las noticias o los eventos que comparten o comentan, a fin de promover la comercialización de productos que se consideren de interés para ellos. ¿Qué grupos de interés del desarrollo del proyecto son de utilidad para generar la información relativa a las preferencias que se esperan del usuario?",
        "answer": "\"Usuarios finales y soporte técnico\".",
        "explanation": "Los usuarios finales proporcionan datos directos sobre sus preferencias, mientras que el soporte técnico facilita la interpretación y estructuración de esa información para su análisis y uso."
    },
    {
        "index": "15",
        "text": "Una institución dedicada al cuidado del ambiente solicita apoyo para el desarrollo de un software que permita llevar el control de la información de las especies nativas de una entidad federativa. Ha obtenido recursos económicos de una convocatoria estatal, en la que se especifican algunas condiciones como mínimos de accesibilidad del software. ¿Qué stakeholder debe considerarse en primer término para determinar la factibilidad del proyecto?",
        "answer": "\"Usuarios finales\".",
        "explanation": "Los usuarios finales son esenciales para evaluar la factibilidad porque sus necesidades y características (como accesibilidad) influyen directamente en el diseño y desarrollo del software."
    },
    {
        "index": "16",
        "text": "Se desea diseñar una aplicación móvil para que los alumnos hagan pedidos de comida en una cafetería universitaria, con el propósito de reducir la acumulación de personas en el establecimiento y el tiempo de espera en filas. ¿Qué técnica de recolección de requerimientos se debe utilizar para evaluar el alcance de propósito?",
        "answer": "\"Entrevista\".",
        "explanation": "Las entrevistas permiten obtener información específica y detallada de los usuarios sobre sus necesidades y expectativas, lo cual es clave para evaluar el alcance y propósitos de la aplicación."
    },
    {
        "index": "17",
        "text": "Una empresa desarrolladora de software realiza, para cada sistema que sus clientes le solicitan, una estimación donde se contemplan los datos de las tablas que se muestran como entrada. A partir de lo anterior se genera como resultado: $img$\".  \n   - **Respuesta:** No hay respuesta seleccionada.  \n   - **Explicación:** Sin imágenes o contexto adicional, no es posible determinar si la técnica utilizada es \"Cocomo\", \"Puntos de función\" o \"Planning poker\".\n\n2. **Pregunta 18:**  \n   - **Texto:** \"En una empresa farmacéutica se solicitó a la gerencia de Tecnologías de Información que desarrollara un sistema para controlar los stocks de los genéricos intercambiables existentes en las diferentes sucursales. Se dispone de información específica de cada sucursal y de los diferentes módulos, como reportes, inventarios y ventas. ¿Qué técnica se requiere para determinar el alcance del proyecto de software?",
        "answer": "No hay respuesta seleccionada.",
        "explanation": "La selección depende del tipo de evaluación del alcance; los \"Casos de uso\" son útiles para escenarios específicos, mientras que \"Puntos de función\" miden tamaño funcional."
    },
    {
        "index": "19",
        "text": "Una lista tiene la siguiente lista de tres requisitos, la cual se priorizó y etiquetó usando la técnica Moscow:  \n      - El sistema debe de ser compatible con Android (M)  \n      - El sistema debe ser compatible con iOS (M)  \n      - El sistema debe notificar sobre envíos no realizados (C)  \n   ¿Cuál requisito tiene una prioridad más baja?",
        "answer": "No hay respuesta seleccionada.",
        "explanation": "Según la técnica Moscow, \"C\" (Could have) tiene una prioridad más baja comparada con \"M\" (Must have), por lo que la respuesta sería: \"Notificación sobre envíos no realizados (C)\"."
    },
    {
        "index": "20",
        "text": "El equipo de desarrollo ha decidido tomar el primer elemento del backlog para estimar el tiempo requerido de programación y para ello deben asignar story points. Sin embargo, existen diferencias con respecto al tiempo que les llevará tal desarrollo por lo que se requiere utilizar una técnica que permita a sus integrantes ponerse de acuerdo y estimar el esfuerzo necesario. ¿Qué técnica se debe usar?",
        "answer": "No hay respuesta seleccionada.",
        "explanation": "\"Planning poker\" es la técnica adecuada para resolver discrepancias en estimaciones, ya que fomenta el consenso entre los miembros del equipo mediante discusiones."
    },
    {
        "index": "21",
        "text": "Una maquiladora de pantalones solicitó el apoyo de una empresa de software para el desarrollo de una nueva versión del sistema de control del proceso de producción, debido a la gran cantidad de defectos presentes en la fábrica. Se busca incluir sensores que adviertan sobre posibles desviaciones de los estándares por cumplir. ¿Qué técnica de priorización de requerimientos se debe aplicar?",
        "answer": "No hay respuesta seleccionada.",
        "explanation": "\"Scorecard\" sería una técnica útil en este caso, ya que permite evaluar y priorizar los requerimientos con base en factores como impacto y costo, esenciales para resolver problemas críticos como defectos en producción."
    },
    {
        "index": "27",
        "text": "Una empresa de desarrollo de software debe implementar un sistema informático de gestión de tutorías para una reconocida universidad. Entre los requisitos del cliente se incluye que contenga un dashboard con información obtenida del sistema externo de servicios escolares desarrollado con enfoque orientado a objetos. Por otro lado, también debe apegarse a proceso existente, ya que este se encuentra certificado. Indique el lenguaje de modelado por utilizar para construir y documentar el sistema de forma gráfica, de acuerdo con los requerimientos establecidos.",
        "answer": "\"UML (Unified Modeling Language)\".",
        "explanation": "UML es el estándar para modelar sistemas orientados a objetos y se utiliza ampliamente para documentar procesos y sistemas de software con diagramas como clases, casos de uso, y secuencia, lo cual es ideal para cumplir con los requisitos del cliente."
    },
    {
        "index": "29",
        "text": "Se requiere escribir historias de un usuario con perfil de viajero para diseñar una aplicación de reservación de vuelos. ¿Qué historia es la más adecuada?",
        "answer": "\"Como viajero, quiero que el sistema me muestre en orden los vuelos más baratos de mis fechas disponibles.\"",
        "explanation": "Esta historia está redactada de manera clara, centrada en el usuario (perfil de viajero) y sus necesidades específicas, además de ser breve y directa, lo que facilita su implementación."
    },
    {
        "index": "30",
        "text": "Un sistema web de pagos a terceros está sujeto constantemente a revisiones de seguridad para evitar fraudes; los fallos al sistema son revisados por medio de tickets que permiten confirmar transacciones que no fueron exitosas con los clientes o con las instituciones bancarias involucradas en la disposición de los recursos. Se tiene como objetivo cumplir el escenario de calidad para el atributo rendimiento:  \n     Fuente = clientes  \n     Estímulo = 85 clientes simultáneamente  \n     Entorno = operación normal  \n     Artefacto = interfaz de usuario  \n     Respuesta = tiempo de respuesta  \n   El estímulo de respuesta al estímulo especificado representa el tiempo en que...",
        "answer": "\"Atiende un cliente\".",
        "explanation": "El tiempo de respuesta mide la capacidad del sistema para responder a un cliente de manera efectiva en un entorno de operación normal, especialmente con la carga especificada de usuarios simultáneos."
    },
    {
        "index": "31",
        "text": "En el proceso de compras de un sistema se deben realizar las siguientes transacciones: ingreso de la requisición, emisión de la solicitud de cotización y emisión de la orden de compra. Además, deben visualizarse los flujos de los procesos para identificar las áreas que necesitan mejoras o para destacar los sectores de eficiencia. ¿Qué artefactos se necesita documentar de acuerdo con las especificaciones de requerimientos dadas?",
        "answer": "\"Diagrama de actividades\".",
        "explanation": "Un diagrama de actividades es ideal para visualizar los flujos de procesos, destacando áreas de mejora y eficiencia, ya que muestra de forma gráfica las secuencias de acciones y decisiones dentro de un proceso."
    },
    {
        "index": "32",
        "text": "Una empresa que se dedica a la fabricación de baños de vapor está inmersa en un proceso de transformación digital y para ello han surgido algunos requerimientos relacionados con el nuevo producto de software que se va a implementar. ¿Cuál de los siguientes requerimientos forma parte de la visión del producto y del alcance del proyecto?",
        "answer": "\"Se debe contratar a un arquitecto de datos para la recopilación e integración de la información de clientes potenciales\".",
        "explanation": "Este requerimiento aborda aspectos estratégicos del proyecto y contribuye a la visión general del producto, ya que la recopilación e integración de datos son esenciales para el alcance y éxito del proyecto."
    },
    {
        "index": "34",
        "text": "Una empresa de desarrollo informático está escalando su producción de software, por lo que debe mejorar la gestión de sus procesos. En lo concerniente a la gestión de requerimientos, actualmente usa MS Office y desea migrar a otra herramienta; sin embargo, se ha contemplado que la principal restricción para ello es que es necesario que esta sea de uso libre y accesible, vía plataforma web. ¿Qué herramienta de gestión de desarrollo debe elegirse?",
        "answer": "\"DRES\".",
        "explanation": "DRES es una herramienta de uso libre y accesible a través de la web, cumpliendo con la principal restricción mencionada en el contexto del problema."
    },
    {
        "index": "35",
        "text": "Un programa social gubernamental de alcance nacional va a iniciar y requiere garantizar el acceso masivo de solicitudes a una plataforma web. Como los requisitos para los aspirantes al programa son extensos, se piensa que habrá una gran cantidad de usuarios en los días finales de la convocatoria con el riesgo de que la plataforma colapse por saturación. Existen alternativas tecnológicas para evitar este problema pero tienen un alto costo. ¿Qué técnica de gestión de riesgos debe emplearse para determinar aquella alternativa que equilibra la relación costo-beneficio?",
        "answer": "\"Proyección del riesgo\".",
        "explanation": "La proyección del riesgo implica evaluar el impacto potencial de los riesgos, como la saturación de la plataforma, y comparar alternativas tecnológicas en términos de costo y beneficio para seleccionar la más adecuada."
    },
    {
        "index": "36",
        "text": "En una aplicación móvil para una tienda de autoservicio, el usuario escanea el código de producto y así se va generando su ticket de salida, para ahorrar tiempo al momento del cobro. Se ha decidido incorporar nuevas funcionalidades a la aplicación, entre ellas, que se puedan integrar las frutas y verduras a los registros, lo cual implica usar el celular de los clientes como báscula. Los puntos indispensables que debe llevar a cabo el control de cambio de este requerimiento son _, _ y _.",
        "answer": "\"Análisis funcional - costo - tiempo\".",
        "explanation": "Para incorporar nuevas funcionalidades, es esencial realizar un análisis funcional (para evaluar viabilidad y requisitos), estimar el costo asociado al desarrollo, y determinar el tiempo necesario para implementarlo. Esto asegura un control efectivo del cambio."
    },
    {
        "index": "37",
        "text": "En época de elecciones se ha pedido a la autoridad encargada de la legalidad del proceso que genere un portal web con una aplicación que permita a la ciudadanía ubicar la casilla que les corresponde para emitir su voto, por medio de la búsqueda del nombre, el código postal, la colonia de procedencia o algún otro dato que conozcan. Se tiene que considerar la compatibilidad con los distintos dispositivos (teléfonos, tabletas o computadoras) y la amplia gama de sistemas operativos desde los que se puede conectar el usuario. ¿Cuál es el requisito funcional de usuario que se relaciona con el planteamiento?",
        "answer": "\"Indicar cómo llegar al destino\".",
        "explanation": "El propósito principal es que los usuarios puedan ubicar la casilla para emitir su voto. Esto implica proporcionarles direcciones claras o indicaciones sobre cómo llegar, lo cual corresponde directamente al requisito funcional de \"indicar cómo llegar al destino\"."
    },
    {
        "index": "39",
        "text": "En una línea aérea se tiene un servidor que toma las peticiones web, la redirecciona a un servidor de balanceo de carga y realiza la primera autenticación del usuario en 0.006 segundos; el servidor de balanceo de carga administra a 10 servidores que son activados o desactivados en función de la carga de usuarios que puede alcanzar (hasta 200 al mismo tiempo) y aumentarse en hasta 200%. La autenticación solo permite tres intentos antes de bloquearse. ¿Cuál es el requerimiento de restricción arquitectónico que corresponde al atributo de calidad de escalabilidad?",
        "answer": "\"El tiempo de autenticación de los usuarios debe ser siempre de 0.006 segundos, sin que se degrade, aún cuando la carga de usuarios se incremente hasta en 200%\".",
        "explanation": "La escalabilidad asegura que el sistema mantenga su desempeño independientemente del aumento en la carga, por lo que el tiempo de respuesta constante bajo incrementos de usuarios es clave para este atributo."
    },
    {
        "index": "40",
        "text": "En una empresa de mensajería se necesita activar un nuevo sistema tipo web; además, dentro de la intranet, el sistema debe atender a los controladores que suben fotos y archivos de cada embarque que se enviará al repositorio de documentos de la empresa. Por su parte, las fotos y los archivos tienen un peso desde 1 kB hasta 100 MB. Los patrones arquitectónicos que se deben utilizar para satisfacer la arquitectura necesaria y atender al sistema planteado son...",
        "answer": "\"Bus y cliente-servidor\".",
        "explanation": "El patrón de \"bus\" facilita la integración de sistemas distribuidos para la transmisión de datos (como fotos y archivos), mientras que \"cliente-servidor\" proporciona la arquitectura básica para que los usuarios interactúen con el sistema y almacenen datos."
    },
    {
        "index": "41",
        "text": "En una empresa de construcción de partes automotrices existen diferentes piezas de software que controlan la producción. Se ha solicitado al arquitecto de software la creación de una nueva arquitectura que unifique el control de las líneas de producción. Así mismo, recibe documentados los atributos de calidad ya definidos y necesita identificar de manera interactiva qué tácticas arquitectónicas resolverán los atributos de calidad. ¿Qué método de diseño de software requiere implementar el arquitecto?",
        "answer": "\"Attribute-driven design (ADD)\".",
        "explanation": "ADD es un método que se centra en los atributos de calidad como punto de partida para diseñar una arquitectura, identificando tácticas específicas para satisfacerlos y unificando la estructura de los sistemas existentes."
    }
]