[
  {
    "imageName": "32",
    "imageIndex": "173",
    "index": 32,
    "text": "Un equipo, desarrollo en sistema de incorporación transaccional, utilizando una metodología de desarrollo RUP. Con base en los requisitos funcionales y el análisis de sistema, se estimado una duración de 10 meses, durante los cuales será implementado por cinco programadores quienes cobran $1,500 por día. Sin embargo, el cliente ha solicitado un tiempo de 9 meses para la terminación del proyecto.\n\n¿Qué método permite identificar los ajustes requeridos por cumplir con la solicitud del cliente?",
    "options": [
      {
        "index": 0,
        "text": "Variación del cronograma "
      },
      {
        "index": 1,
        "text": "Índice de desempeño del cronograma"
      },
      {
        "index": 2,
        "text": "Ruta crítica"
      }
    ],
    "answer": {
      "index": null,
      "text": ""
    }
  },
  {
    "imageName": "33",
    "imageIndex": "174",
    "index": 33,
    "text": "La empresa Teknei desarrolla un software para la administración de un servicio de transporte público de autobuses en una ciudad donde debe controlar recorridos por camiones, cobro por usuario estación con mayor demanda estación con menor demanda, tiempo de recorrido, etcétera. El sistema presenta un error en el código ya que no está ejecutando la instrucción correcta para que se contabilice de manera adecuada el cobro por usuario y se vaya sumando para que nos arroje el total de los ingresos al día.\n\n¿Cuál técnica se requiere para resolver el problema?",
    "options": [
      {
        "index": 0,
        "text": "Depuración"
      },
      {
        "index": 1,
        "text": "Bitácora "
      },
      {
        "index": 2,
        "text": "Guías y estándares de programación"
      }
    ],
    "answer": {
      "index": null,
      "text": ""
    }
  },
  {
    "imageName": "34",
    "imageIndex": "175",
    "index": 34,
    "text": "Calidrax desarrolla  un software para el control de contratos en compra  de suministros, el Departamento de Calidad tiene que validar en dónde se encuentra el error, documentar la revisión, inspeccionar para identificar las fallas y tener el registro de incidencias. Es necesario realizar las anotaciones pertinentes con identificación de defectos en el sistema.\n\n¿Cuál es el método que tiene que implementar el departamento de calidad?",
    "options": [
      {
        "index": 0,
        "text": "Revisiones de desempeño "
      },
      {
        "index": 1,
        "text": "Hojas de verificación "
      },
      {
        "index": 2,
        "text": "Listas de verificación"
      }
    ],
    "answer": {
      "index": null,
      "text": ""
    }
  },
  {
    "imageName": "35",
    "imageIndex": "176",
    "index": 35,
    "text": "Un equipo desarrolla un sistema que cuenta con 10,000 líneas de código, el esfuerzo ha sido de 50 p* m y  se ha detectado 20 errores. Calcule el porcentaje de calidad del producto",
    "options": [
      {
        "index": 0,
        "text": "0.2%"
      },
      {
        "index": 1,
        "text": "40.0%"
      },
      {
        "index": 2,
        "text": "99.8%"
      }
    ],
    "answer": {
      "index": null,
      "text": ""
    }
  },
  {
    "imageName": "36",
    "imageIndex": "177-180",
    "index": 36,
    "text": "Una empresa utiliza RUP como método de desarrollo de software. El cliente ha definido las funcionalidades del sistema, entre ellas que cuando un usuario ingrese y no esté registrado en el sistema, pueda registrarse. Se necesita verificar que el documento de requerimientos cumpla con lo que el cliente ha establecido. \n\n\n De acuerdo con la gestión de la calidad en la disciplina de requisitos y los artefactos de requisitos para construir coherencia (entre estándares de artefacto y otros artefactos), determine el caso de uso que garantiza la calidad del producto",
    "options": [
      {
        "index": 0,
        "text": "$img$"
      },
      {
        "index": 1,
        "text": "$img$"
      },
      {
        "index": 2,
        "text": "$img$"
      }
    ],
    "answer": {
      "index": null,
      "text": ""
    }
  }
]