[
    {
        "imageIndex": "105",
        "index": 63,
        "text": "En una aplicación web de un hospital se maneja todo tipo de expediente electrónico de los pacientes,\npor lo que se almacenan múltiples archivos de diferente tamaño y formato.\n\nClasifique los métodos de envió y recepción de datos al servidor de acuerdo con las peticiones:\n\n1. Es necesario conocer si la pagina principal esta disponible por medio del protocolo HTTP/1.1\nsin obtener cuerpo de respuesta.\n\n2. Es necesario saber si la pagina del expendiente tiene habilitado el metodo de transferencia POST.\n\n3. Envia el expendiente para su almacenamiento.",
        "options": [
            {
                "index": 0,
                "text": "1-GET, 2-OPTIONS, 3-POST"
            },
            {
                "index": 1,
                "text": "1-HEAD, 2-OPTIONS, 3-PUT"
            },
            {
                "index": 2,
                "text": "1-HEAD, 2-GET, 3-POST"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 63
    },
    {
        "imageIndex": "63",
        "index": 51,
        "text": "Una empresa constructora ha concluido un sistema de ventas. Entre los requerimientos que presenta se encuentra emitir facturas electrónicas, para lo cual tiene ya otro sistema en operación. Se busca un diseño que permita un acoplamiento a nivel externo entre ambos sistemas. ¿Cuál de las opciones expresa una solución acorde al diseño solicitado?",
        "options": [
            {
                "index": 0,
                "text": "Invocar procedimientos almacenados en el sistema de facturación"
            },
            {
                "index": 1,
                "text": "Modificar el sistema de ventas para incluir en su código las rutinas del sistema de facturación"
            },
            {
                "index": 2,
                "text": "Crear un archivo de intercambio para que el sistema de ventas grabe la información necesaria de la venta y el módulo de facturación procese información a partir del archivo"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 51
    },
    {
        "imageIndex": "62",
        "index": 50,
        "text": "Un desarrollador debe de implementar un componente para el cálculo del IVA; éste se va a utilizar en diferentes sistemas. La interfaz con el componente solo se lleva a cabo proporcionando la cantidad, el porcentaje del IVA y regresa la cantidad total a pagar.\n\n¿Qué tipo de cohesión debe utilizar el desarrollador para ejecutar el componente?",
        "options": [
            {
                "index": 0,
                "text": "Funcional"
            },
            {
                "index": 1,
                "text": "Secuencial"
            },
            {
                "index": 2,
                "text": "Casual"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 50
    },
    {
        "imageIndex": "58-61",
        "index": 49,
        "text": "Un distribuidor de productos tecnológicos va a implementar un nuevo sistema para administrar su negocio, con los siguientes elementos:\n    • Módulo de clientes. En dicho bloque se gestionarán los datos de clientes y medios de pago\n    • Módulo de ventas. Serán encargados de administrar las compras que realizan los clientes\n    • Módulo de proveedores. Se administrarán sus contactos y las adquisiciones hechas con cada uno de ellos\n    • Módulo de facturación. Emitirá y administrará las facturas electrónicas tanto para clientes como para las recepciones por parte de los proveedores\n\n¿Qué diagrama representa la arquitectura basada en dichos módulos?",
        "options": [
            {
                "index": 0,
                "text": "$img$"
            },
            {
                "index": 1,
                "text": "$img$"
            },
            {
                "index": 2,
                "text": "$img$"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 49
    },
    {
        "imageIndex": "55",
        "index": 42,
        "text": "El desarrollo de un sistema para la administración de una clínica veterinaria cuenta con las siguientes historias de usuario:\n    1. Un paciente solicita una cita a la recepcionista, la cual consulta la agenda en busca de días y horas disponibles. Una vez determinada la fecha y la hora, la recepcionista registra los datos de usuario y el motivo de la cita\n    2. Al iniciar la jornada, la recepcionista envía al médico una lista de las citas por atender. Si se presenta el paciente a la cita, el médico cambia el estado de la cita a Atendida. En caso contrario, cambia el estado a No atendida\n    3. Cada vez que termina una consulta, el médico indica a la recepcionista el monto total de la consulta por los conceptos de honorarios, medicinas, materiales utilizados. La recepcionistas se encarga de registrar los pagos y de generar un reporte al final de la jornada.\n\nDetermine el esqueleto de arquitectura que implementa este sistema.",
        "options": [
            {
                "index": 0,
                "text": "$img$"
            },
            {
                "index": 1,
                "text": "$img$"
            },
            {
                "index": 2,
                "text": "$img$"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 48
    }
]