[
    {
        "imageIndex": "163",
        "index": 22,
        "text": "Un equipo desarrolla un sistema de reservas para un hotel y utilizar RUP como método de desarrollo. Ha concluido un ciclo de vida para el proyecto y el cliente solicita incorporar nuevas funcionalidades al sistema por lo que se debe estimar el tiempo de desarrollo con base en la ruta crítica.\n\nDe acuerdo con los datos de la tabla, determine, en semanas, el tiempo de desarrollo para incorporar las nuevas funcionalidades al sistema\n\n$img$",
        "options": [
            {
                "index": 0,
                "text": "9"
            },
            {
                "index": 1,
                "text": "10"
            },
            {
                "index": 2,
                "text": "11"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 22
    },
    {
        "imageIndex": "16",
        "index": 15,
        "text": "Una maquiladora de pantalones solicitó el apoyo de una empresa de software para el desarrollo de una nueva versión del sistema de control del proceso de producción, debido a la gran cantidad de defectos presentes en la fábrica. Se busca incluir sensores que adviertan sobre posibles desviaciones de los estándares por cumplir.\n\n¿Qué técnica de priorización de requerimiento se debe aplicar?",
        "options": [
            {
                "index": 0,
                "text": "Scorecard"
            },
            {
                "index": 1,
                "text": "Puntos de función"
            },
            {
                "index": 2,
                "text": "Líneas de código"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 21
    },
    {
        "imageIndex": "162",
        "index": 21,
        "text": "Se implementará un desarrollo web para una empresa de la industria planificadora. En ese sentido, el requerimiento es administrar las ventas en la línea de sus productos. Asimismo, el servidor propio para la empresa debe contar con las siguientes características: \n\nprocesador Intel Xeon(ocho núcleos)\n\nDisco duro 2 × 1 TB en RAID 1 \n\nMemoria RAM de 8 GB.\n\nControl de puerto.\n\nSistema operativo Linux.\n\nPor otra parte, se lleva a cabo un estudio de costo, y el valor optimista del servidor es de $8,000, el más probable es de $10,000 y la pesimista es de $12,000;  no obstante, el contrato de mantenimiento costaría $5,000 y los componentes de reemplazo de servidor $2,500.\n\nAplicando la distribución beta de la estimación por tres valores, ¿cuál es el costo total del servidor para el desarrollo web?",
        "options": [
            {
                "index": 0,
                "text": "$16,500"
            },
            {
                "index": 1,
                "text": "$17,500"
            },
            {
                "index": 2,
                "text": "$18,500"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 21
    },
    {
        "imageIndex": "15",
        "index": 14,
        "text": "El equipo de desarrollo ha decidido tomar el primer elemento del backlog para estimar el tiempo requerido de programación y para ello deben asignar story points. Sin embargo, existen diferencias con respecto al tiempo que les llevará tal desarrollo por lo que se requiere utilizar una técnica que permita a sus integrantes ponerse de acuerdo y estimar el esfuerzo necesario.\n\n¿Qué técnica se debe usar?",
        "options": [
            {
                "index": 0,
                "text": "Estimación por analogía"
            },
            {
                "index": 1,
                "text": "Juicio de expertos"
            },
            {
                "index": 2,
                "text": "Planning poker"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 20
    },
    {
        "imageIndex": "161",
        "index": 20,
        "text": "Un equipo de trabajo requiere desarrollar una aplicación Movil, multi plataforma( iOS, Android, Windows Phone en C# y .NET) para ayudar a los pacientes diabéticos a calcular las dosis de insulina antes de la ingesta diaria de los alimentos. El cálculo se realiza con base en el conteo de carbohidratos, el nivel de glucosa actual y otros parámetros. Adicionalmente, se ha pedido que la aplicación conserve el aspecto y comportamiento inherentes a cada tipo de dispositivo móvil. \n\n¿Cuál de las siguientes plataformas se requiere para desarrollar la aplicación?",
        "options": [
            {
                "index": 0,
                "text": "Knockout"
            },
            {
                "index": 1,
                "text": "Ionic"
            },
            {
                "index": 2,
                "text": "Xamarin"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 20
    }
]