[
    {
        "imageIndex": "14",
        "index": 13,
        "text": "Una lista tiene la siguiente lista de tres requisitos, la cual se priorizó y etiquetó usando la técnica Moscow:\n\n    • El sistema debe de ser compatible con Android (M)\n    • El sistema debe ser compatible con iOS (M)\n    • El sistema debe notificar sobre envíos no realizados (C)\n\n¿Cuál requisito tiene una prioridad más baja?",
        "options": [
            {
                "index": 0,
                "text": "Compatibilidad con Android"
            },
            {
                "index": 1,
                "text": "Compatibilidad con iOS (W)"
            },
            {
                "index": 2,
                "text": "Notificación sobre envíos no realizados (C)"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 19
    },
    {
        "imageIndex": "160",
        "index": 19,
        "text": "Un sistema de rastreo, dentro de un centro de tutorías para estudiantes, se accede mediante una aplicación web; en este, los estudiantes o sus \ntutores pueden registrar su ingreso o salida. El centro de tutorías puede rastrear la asistencia, las actualizaciones de estado y, además, pueden registrar información de contacto para tutores y estudiantes. Asimismo, se probó cuando fuera aumentando el número de usuarios (Estudiantes y tutores) no disminuyera la velocidad y tampoco la cantidad de tráfico en la red.\n\n¿Qué artefacto permite documentar los resultados de las pruebas en la aplicación web?",
        "options": [
            {
                "index": 0,
                "text": "Formulario de carta de aceptación"
            },
            {
                "index": 1,
                "text": "Formulario de instrucciones de entrega"
            },
            {
                "index": 2,
                "text": "Matriz de seguimiento de requerimientos"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 19
    },
    {
        "imageIndex": "13",
        "index": 12,
        "text": "En una empresa farmacéutica se solicitó a la gerencia de Tecnologías de Información que desarrollara un sistema para controlar los stocks de los genéricos intercambiables existentes en las diferentes sucursales. Se dispone de información específica de cada sucursal y de los diferentes módulos, cómo reportes, inventarios y ventas.\n\n¿Qué técnica se requiere para determinar el alcance del proyecto de software?",
        "options": [
            {
                "index": 0,
                "text": "Casos de uso"
            },
            {
                "index": 1,
                "text": "Puntos de función"
            },
            {
                "index": 2,
                "text": "Cocomo"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 18
    },
    {
        "imageIndex": "159",
        "index": 18,
        "text": "Se han contratado los servicios de un ingeniero de software para documentar una API que se liberará en una semana. Debido a que el líder de proyecto responsable renunció y no dejó nada documentado, se revisaron los programas y se encontró que todas las clases sin excepción, tienen los identificadores en el inicio: @autor,@deprecated,@param,@return,@see,@versión. Es necesario que la documentación sea generada en HTML. \n\n¿Cuál es la herramienta necesaria para generar documentación de acuerdo con lo planteado?",
        "options": [
            {
                "index": 0,
                "text": "DocFX"
            },
            {
                "index": 1,
                "text": "JavaDoc"
            },
            {
                "index": 2,
                "text": "Docxgen"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 18
    },
    {
        "imageIndex": "11-12",
        "index": 11,
        "text": "Una empresa desarrolladora de software realiza, para cada sistema que sus clientes le solicitan, una estimación donde se contemplan los datos de las tablas que se muestran como entrada:\n\n$img$\n\nA partir de lo anterior se genera como resultado:\n\n$img$",
        "options": [
            {
                "index": 0,
                "text": "Cocomo con puntos de función"
            },
            {
                "index": 1,
                "text": "Puntos de función"
            },
            {
                "index": 2,
                "text": "Planning poker"
            }
        ],
        "answer": {
            "index": null,
            "text": ""
        },
        "questionIndex": 17
    }
]